## Plan Result (test-global)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest"
        name                                         = "hmcts-perftest"
        tags                                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (14 unchanged attributes hidden)

      ~ backend_pool {
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/idam-web-admin"
            name                = "idam-web-admin"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-perftest.ukwest.cloudapp.azure.com" -> "firewall-nonprodi-palo-cft-perftest.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/idam-user-dashboard"
            name                = "idam-user-dashboard"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-perftest.ukwest.cloudapp.azure.com" -> "firewall-nonprodi-palo-cft-perftest.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/et-sya"
            name                = "et-sya"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-perftest.uksouth.cloudapp.azure.com" -> "firewall-nonprodi-palo-cft-perftest.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }





        # (227 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1257,"Program":"tfcmt","SHA1":"","Target":"test-global","Vars":{}} -->